fe40/tutorials/rheoEFoam/ICEO/PoissonBoltzmann/constant/electricProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      electricProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
parameters
{
        type             PoissonBoltzmann;      
  
        relPerm          relPerm [ 0 0 0 0 0 0 0 ] 80;  
        T                T [ 0 0 0 1 0 0 0 ] 300;
        psiContrib       false;
        
        species
        (        
           cations
           {        
              z                 z [ 0 0 0 0 0 0 0 ] 1;      
              c0                c0 [ 0 -3 0 0 1 0 0 ] 9.48946E-05;          
           }
           
           anions
           {  
              z                 z [ 0 0 0 0 0 0 0 ] -1;         
              c0                c0 [ 0 -3 0 0 1 0 0 ] 9.48946E-05;         
           }               
        );          
}

// ************************************************************************* //
